cask_args appdir: "/Applications"

# Language
brew "go"
brew "rust"

# Tools
brew "asdf"
brew "awscli"
brew "aws-cli"
brew "bat"
brew "deno"
brew "dog"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "jq"
brew "k6"
brew "lazygit"
brew "lcov"
brew "mas"
brew "nvim"
brew "ripgrep"
brew "sd"
brew "sheldon"
brew "starship"
brew "tmux"
brew "tokei"
brew "vim"
brew "wget"
brew "wrk"
brew "yq"
brew "z"
brew "zoxide"

# Application
cask "1password"
cask "1password-cli"
cask "arc"
cask "charles"
cask "figma"
cask "finch"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-japanese-ime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "linear-linear"
cask "notion-calendar"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "wezterm"
cask "zoom"
cask "orbstack"

mas "Messenger", id: 1480068668
mas "Skitch", id: 425955336
mas "Xcode", id: 497799835
