cask_args appdir: "/Applications"

# Language
brew "go"
brew "rust"

# Tools
brew "awscli"
brew "aws-cdk"
brew "bat"
brew "bun"
brew "codex"
brew "deno"
brew "dog"
brew "duckdb"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "go"
brew "git"
brew "git-delta"
brew "jq"
brew "k6"
brew "k9s"
brew "lazygit"
brew "lcov"
brew "mas"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "rust"
brew "sd"
brew "sheldon"
brew "starship"
brew "tmux"
brew "tokei"
brew "vim"
brew "wget"
brew "wrk"
brew "yq"
brew "z"
brew "zoxide"

# Application
cask "1password"
cask "1password-cli"
cask "arc"
cask "charles"
cask "chatgpt"
cask "claude"
cask "cron"
cask "figma"
cask "fork"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-japanese-ime"
cask "gpg-suite"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keycastr"
cask "linear-linear"
cask "notion-calendar"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "wezterm"
cask "zen"
cask "zoom"

mas "Messenger", id: 1480068668
mas "Xcode", id: 497799835
